In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates=pd.date_range('20130101',periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.554471 -0.083495  1.071596 -0.663349
2013-01-02  0.916487  1.884538 -0.628316 -0.378610
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259
2013-01-05  0.448696 -2.292069 -0.057458  1.910591
2013-01-06  0.638238  0.257352  1.009275 -0.123521

In [8]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.554471 -0.083495  1.071596 -0.663349
2013-01-02  0.916487  1.884538 -0.628316 -0.378610
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259
2013-01-05  0.448696 -2.292069 -0.057458  1.910591

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259
2013-01-05  0.448696 -2.292069 -0.057458  1.910591
2013-01-06  0.638238  0.257352  1.009275 -0.123521

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.values

array([[ 0.55447072, -0.08349481,  1.07159609, -0.66334856],
       [ 0.9164868 ,  1.88453838, -0.62831565, -0.37860995],
       [ 0.01776074, -0.19755537, -0.04541207, -0.43669942],
       [-0.67364655,  0.61400565, -0.58690339, -0.87025852],
       [ 0.44869637, -2.29206911, -0.05745798,  1.91059096],
       [ 0.63823767,  0.25735187,  1.00927547, -0.12352119]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.317001  0.030463  0.127130 -0.093641
std    0.566964  1.362992  0.750278  1.014341
min   -0.673647 -2.292069 -0.628316 -0.870259
25%    0.125495 -0.169040 -0.454542 -0.606686
50%    0.501584  0.086929 -0.051435 -0.407655
75%    0.617296  0.524842  0.745604 -0.187293
max    0.916487  1.884538  1.071596  1.910591

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.554471    0.916487    0.017761   -0.673647    0.448696    0.638238
B   -0.083495    1.884538   -0.197555    0.614006   -2.292069    0.257352
C    1.071596   -0.628316   -0.045412   -0.586903   -0.057458    1.009275
D   -0.663349   -0.378610   -0.436699   -0.870259    1.910591   -0.123521

In [18]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.663349  1.071596 -0.083495  0.554471
2013-01-02 -0.378610 -0.628316  1.884538  0.916487
2013-01-03 -0.436699 -0.045412 -0.197555  0.017761
2013-01-04 -0.870259 -0.586903  0.614006 -0.673647
2013-01-05  1.910591 -0.057458 -2.292069  0.448696
2013-01-06 -0.123521  1.009275  0.257352  0.638238

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.448696 -2.292069 -0.057458  1.910591
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699
2013-01-01  0.554471 -0.083495  1.071596 -0.663349
2013-01-06  0.638238  0.257352  1.009275 -0.123521
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259
2013-01-02  0.916487  1.884538 -0.628316 -0.378610

In [20]:
df['A']

2013-01-01    0.554471
2013-01-02    0.916487
2013-01-03    0.017761
2013-01-04   -0.673647
2013-01-05    0.448696
2013-01-06    0.638238
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01  0.554471 -0.083495  1.071596 -0.663349
2013-01-02  0.916487  1.884538 -0.628316 -0.378610
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.916487  1.884538 -0.628316 -0.378610
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259

In [23]:
df.loc[dates[0]]

A    0.554471
B   -0.083495
C    1.071596
D   -0.663349
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.554471 -0.083495
2013-01-02  0.916487  1.884538
2013-01-03  0.017761 -0.197555
2013-01-04 -0.673647  0.614006
2013-01-05  0.448696 -2.292069
2013-01-06  0.638238  0.257352

In [25]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.916487  1.884538
2013-01-03  0.017761 -0.197555
2013-01-04 -0.673647  0.614006

In [26]:
df.iloc[3]

A   -0.673647
B    0.614006
C   -0.586903
D   -0.870259
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
df

                   A         B         C         D
2013-01-01  0.554471 -0.083495  1.071596 -0.663349
2013-01-02  0.916487  1.884538 -0.628316 -0.378610
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259
2013-01-05  0.448696 -2.292069 -0.057458  1.910591
2013-01-06  0.638238  0.257352  1.009275 -0.123521

In [28]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.554471    0.916487    0.017761   -0.673647    0.448696    0.638238
B   -0.083495    1.884538   -0.197555    0.614006   -2.292069    0.257352
C    1.071596   -0.628316   -0.045412   -0.586903   -0.057458    1.009275
D   -0.663349   -0.378610   -0.436699   -0.870259    1.910591   -0.123521

In [29]:
df.iloc[3]

A   -0.673647
B    0.614006
C   -0.586903
D   -0.870259
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.554471 -0.083495  1.071596 -0.663349
2013-01-02  0.916487  1.884538 -0.628316 -0.378610
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699
2013-01-05  0.448696 -2.292069 -0.057458  1.910591
2013-01-06  0.638238  0.257352  1.009275 -0.123521

In [31]:
df[df>0]

                   A         B         C         D
2013-01-01  0.554471       NaN  1.071596       NaN
2013-01-02  0.916487  1.884538       NaN       NaN
2013-01-03  0.017761       NaN       NaN       NaN
2013-01-04       NaN  0.614006       NaN       NaN
2013-01-05  0.448696       NaN       NaN  1.910591
2013-01-06  0.638238  0.257352  1.009275       NaN

In [32]:
df2=df.copy()

In [34]:
df2['E']=['one','one','two','three','four','three']

In [35]:
df2

                   A         B         C         D      E
2013-01-01  0.554471 -0.083495  1.071596 -0.663349    one
2013-01-02  0.916487  1.884538 -0.628316 -0.378610    one
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699    two
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259  three
2013-01-05  0.448696 -2.292069 -0.057458  1.910591   four
2013-01-06  0.638238  0.257352  1.009275 -0.123521  three

In [36]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699   two
2013-01-05  0.448696 -2.292069 -0.057458  1.910591  four

In [37]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

In [38]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df['F']=s1

In [40]:
df.at[dates[0],'A']=0

In [41]:
df.at

In [42]:
df

                   A         B         C         D      E    F
2013-01-01  0.000000 -0.083495  1.071596 -0.663349    one  NaN
2013-01-02  0.916487  1.884538 -0.628316 -0.378610    one  1.0
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699    two  2.0
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259  three  3.0
2013-01-05  0.448696 -2.292069 -0.057458  1.910591   four  4.0
2013-01-06  0.638238  0.257352  1.009275 -0.123521  three  5.0

In [45]:
df.at[dates[1],'B']=1.0

In [46]:
df

                   A         B         C         D      E    F
2013-01-01  0.000000 -0.083495  1.071596 -0.663349    one  NaN
2013-01-02  0.916487  1.000000 -0.628316 -0.378610    one  1.0
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699    two  2.0
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259  three  3.0
2013-01-05  0.448696 -2.292069 -0.057458  1.910591   four  4.0
2013-01-06  0.638238  0.257352  1.009275 -0.123521  three  5.0

In [47]:
df.iat[0,1]=0

In [48]:
df

                   A         B         C         D      E    F
2013-01-01  0.000000  0.000000  1.071596 -0.663349    one  NaN
2013-01-02  0.916487  1.000000 -0.628316 -0.378610    one  1.0
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699    two  2.0
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259  three  3.0
2013-01-05  0.448696 -2.292069 -0.057458  1.910591   four  4.0
2013-01-06  0.638238  0.257352  1.009275 -0.123521  three  5.0

In [53]:
df.iat[0,1]=2

In [54]:
df

                   A         B         C         D      E    F
2013-01-01  0.000000  2.000000  1.071596 -0.663349    one  NaN
2013-01-02  0.916487  1.000000 -0.628316 -0.378610    one  1.0
2013-01-03  0.017761 -0.197555 -0.045412 -0.436699    two  2.0
2013-01-04 -0.673647  0.614006 -0.586903 -0.870259  three  3.0
2013-01-05  0.448696 -2.292069 -0.057458  1.910591   four  4.0
2013-01-06  0.638238  0.257352  1.009275 -0.123521  three  5.0

In [56]:
df.loc[:,'D']=np.array([5]*len(df))

In [57]:
df

                   A         B         C  D      E    F
2013-01-01  0.000000  2.000000  1.071596  5    one  NaN
2013-01-02  0.916487  1.000000 -0.628316  5    one  1.0
2013-01-03  0.017761 -0.197555 -0.045412  5    two  2.0
2013-01-04 -0.673647  0.614006 -0.586903  5  three  3.0
2013-01-05  0.448696 -2.292069 -0.057458  5   four  4.0
2013-01-06  0.638238  0.257352  1.009275  5  three  5.0

In [58]:
df2=df.copy()

In [61]:
df2[df2 > 0] = -df2

TypeError: Unary negative expects numeric dtype, not object

In [62]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [63]:
df1.loc[dates[0]:dates[1],'E']=1

In [64]:
df1

                   A         B         C  D      E    F      E
2013-01-01  0.000000  2.000000  1.071596  5      1  NaN      1
2013-01-02  0.916487  1.000000 -0.628316  5      1  1.0      1
2013-01-03  0.017761 -0.197555 -0.045412  5    two  2.0    two
2013-01-04 -0.673647  0.614006 -0.586903  5  three  3.0  three

In [65]:
df1.dropna(how='any')

                   A         B         C  D      E    F      E
2013-01-02  0.916487  1.000000 -0.628316  5      1  1.0      1
2013-01-03  0.017761 -0.197555 -0.045412  5    two  2.0    two
2013-01-04 -0.673647  0.614006 -0.586903  5  three  3.0  three

In [66]:
df1.fillna(value=5)

                   A         B         C  D      E    F      E
2013-01-01  0.000000  2.000000  1.071596  5      1  5.0      1
2013-01-02  0.916487  1.000000 -0.628316  5      1  1.0      1
2013-01-03  0.017761 -0.197555 -0.045412  5    two  2.0    two
2013-01-04 -0.673647  0.614006 -0.586903  5  three  3.0  three

In [67]:
pd.isna(df1)

                A      B      C      D      E      F      E
2013-01-01  False  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False  False

In [69]:
df.mean()

A    0.224589
B    0.230289
C    0.127130
D    5.000000
F    3.000000
dtype: float64

In [70]:
df.mean(1)

2013-01-01    2.017899
2013-01-02    1.457634
2013-01-03    1.354959
2013-01-04    1.470691
2013-01-05    1.419834
2013-01-06    2.380973
Freq: D, dtype: float64

In [71]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)

In [72]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [77]:
s=pd.Series(np.random.randint(0,7,size=10))
s

0    4
1    1
2    2
3    4
4    5
5    6
6    0
7    1
8    6
9    0
dtype: int64

In [80]:
s.value_counts()

6    2
4    2
1    2
0    2
5    1
2    1
dtype: int64

In [81]:
df=pd.DataFrame(np.random.randn(10,4))

In [82]:
df

          0         1         2         3
0 -0.151345 -1.222965  0.414902  0.502718
1  2.853584  1.092584 -1.237625 -0.699641
2 -0.199943 -0.562643  0.249628 -1.458830
3  1.770309 -0.739425 -0.554885 -0.547771
4 -0.071982  0.189469  1.172833  0.661995
5 -0.157187 -0.348878 -0.107671 -0.702298
6 -0.979373 -2.127339 -0.024674 -0.582257
7 -1.937752  1.381694  0.240007  1.294759
8 -2.180954  0.697167 -1.476776 -1.846715
9 -1.299384  0.522661 -0.708181  0.018057

In [84]:
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [85]:
df

          A         B         C         D
0  0.347226 -0.634049 -0.649608  0.408411
1 -1.084191 -0.200600  0.390599 -2.597170
2  0.521750 -0.373511  0.104727 -0.640486
3 -1.781647 -0.289540 -0.602076  0.101988
4  0.812369 -0.209825 -1.783903  0.123162
5  0.570714  0.239119  0.013898 -0.072545
6  0.168632 -1.199316 -0.817456  0.157657
7 -2.032439 -0.858455 -0.125001 -1.413538

In [86]:
s=df.iloc[3]

In [87]:
df.append(s,ignore_index=True)

          A         B         C         D
0  0.347226 -0.634049 -0.649608  0.408411
1 -1.084191 -0.200600  0.390599 -2.597170
2  0.521750 -0.373511  0.104727 -0.640486
3 -1.781647 -0.289540 -0.602076  0.101988
4  0.812369 -0.209825 -1.783903  0.123162
5  0.570714  0.239119  0.013898 -0.072545
6  0.168632 -1.199316 -0.817456  0.157657
7 -2.032439 -0.858455 -0.125001 -1.413538
8 -1.781647 -0.289540 -0.602076  0.101988

In [88]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                     'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                      'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

In [89]:
df

     A      B         C         D
0  foo    one  0.240845  0.349847
1  bar    one  2.467680  1.256080
2  foo    two -0.203712  0.110113
3  bar  three  0.476738  0.055946
4  foo    two -0.818922 -2.162975
5  bar    two  0.247774 -1.306608
6  foo    one -1.447135 -1.860454
7  foo  three  0.283629 -1.197341

In [90]:
df.groupby('A').sum()

            C         D
A
bar  3.192192  0.005418
foo -1.945296 -4.760810

In [91]:
df.groupby('B').sum()

              C         D
B
one    1.261389 -0.254526
three  0.760368 -1.141395
two   -0.774860 -3.359470

In [92]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    2.467680  1.256080
    three  0.476738  0.055946
    two    0.247774 -1.306608
foo one   -1.206291 -1.510606
    three  0.283629 -1.197341
    two   -1.022634 -2.052862

In [93]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                        'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                        'one', 'two', 'one', 'two']]))

In [95]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [96]:
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])

In [97]:
df2=df[:4]

In [98]:
df2

                     A         B
first second
bar   one    -0.437579 -1.129672
      two    -0.851000 -0.403986
baz   one    -0.524423 -1.414043
      two    -0.272350 -0.935812

In [99]:
stacked=df2.stack()

In [100]:
stacked

first  second
bar    one     A   -0.437579
               B   -1.129672
       two     A   -0.851000
               B   -0.403986
baz    one     A   -0.524423
               B   -1.414043
       two     A   -0.272350
               B   -0.935812
dtype: float64

In [101]:
stacked.unstack()

                     A         B
first second
bar   one    -0.437579 -1.129672
      two    -0.851000 -0.403986
baz   one    -0.524423 -1.414043
      two    -0.272350 -0.935812

In [102]:
stacked.unstack(1)

second        one       two
first
bar   A -0.437579 -0.851000
      B -1.129672 -0.403986
baz   A -0.524423 -0.272350
      B -1.414043 -0.935812

In [103]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.437579 -0.524423
       B -1.129672 -1.414043
two    A -0.851000 -0.272350
       B -0.403986 -0.935812

In [105]:
rng=pd.date_range('1/1/2012',periods=100,freq='S')

In [106]:
ts=pd.Series(np.random.randint(0,500,len(rng)),index=rng)

In [107]:
ts.resample('5Min').sum()

2012-01-01    26845
Freq: 5T, dtype: int64

In [108]:
rng=pd.date_range('3/6/2012 00:00',periods=5,freq='D')

In [109]:
ts=pd.Series(np.random.randn(len(rng)),rng)

In [110]:
ts

2012-03-06   -0.734484
2012-03-07    0.440871
2012-03-08   -0.003021
2012-03-09   -0.133475
2012-03-10   -0.544109
Freq: D, dtype: float64

In [111]:
ts_utc=ts.tz_localize('UTC')

In [112]:
ts_utc

2012-03-06 00:00:00+00:00   -0.734484
2012-03-07 00:00:00+00:00    0.440871
2012-03-08 00:00:00+00:00   -0.003021
2012-03-09 00:00:00+00:00   -0.133475
2012-03-10 00:00:00+00:00   -0.544109
Freq: D, dtype: float64

In [113]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.734484
2012-03-06 19:00:00-05:00    0.440871
2012-03-07 19:00:00-05:00   -0.003021
2012-03-08 19:00:00-05:00   -0.133475
2012-03-09 19:00:00-05:00   -0.544109
Freq: D, dtype: float64